In [1]:
# Import Data Manipulation Library
import pandas as pd 
import numpy as np

In [ ]:
# Define a series : 1D Array

a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
a = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
#  Using Concept Indexing 
a.dtype

dtype('int64')

In [11]:
print(a[3])
print(a['d'])

4
4

C:\Users\Rutuja\AppData\Local\Temp\ipykernel_8344\2108492381.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[3])

In [13]:
# 2D 
c = pd.DataFrame({'India':[2000],'USA':[3000],'UK':[30000]})
print(c)

   India   USA     UK
0   2000  3000  30000

In [ ]:
# Create Student Database 
database = {'Name': ['Nikhil','Aniket','Mihir','Tanvi','Hemangi'],
            'Age':[10,11,12,13,14,],
            'Marks':[34,56,67,34,56],
            'CGPA':[8,6,9,8,6]
            }
df = pd.DataFrame(database)
print(df)
# create a varaiable df : which will store dataframe

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     34     8
4  Hemangi   14     56     6

In [25]:
df[df['Name']== 'Tanvi']

    Name  Age  Marks  CGPA
3  Tanvi   13     34     8

In [22]:
# Using agg() : Aggregate Function 
df['Marks'].agg(['min','max','mean'])

min     34.0
max     67.0
mean    49.4
Name: Marks, dtype: float64

In [23]:
df[df['Marks']== 67]

    Name  Age  Marks  CGPA
2  Mihir   12     67     9

In [24]:
df[df['CGPA']== 6]

      Name  Age  Marks  CGPA
1   Aniket   11     56     6
4  Hemangi   14     56     6

In [ ]:
# Checking Dataframe  Information

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
 3   CGPA    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [ ]:
# This code will check if any missing values in dataset 
df.isnull().sum()

Name     0
Age      0
Marks    0
CGPA     0
dtype: int64

In [30]:
print(df['Marks'].sum())
print(df['Marks'].mean())
print(df['Marks'].max())
print(df['Marks'].min())
print(df['Marks'].nunique())
print(df['Marks'].unique())
print(df['Marks'].value_counts())
print(df['Name'].value_counts())

247
49.4
67
34
3
[34 56 67]
Marks
34    2
56    2
67    1
Name: count, dtype: int64
Name
Nikhil     1
Aniket     1
Mihir      1
Tanvi      1
Hemangi    1
Name: count, dtype: int64

In [36]:
database = {'Name': ['Nikhil','Aniket','Mihir','Tanvi','Hemangi','Disha','Ajay','Aryan'],
            'Salary':[20000,30000,25000,35000,20000,39000,400000,45000],
            'No_of_Experience':[2,3,1,4,3,5,2,1],
            'Domain':['Tech','NonTech','HR','R&D','NonTech','Tech','HR','R&D'],
            'Age':[22,23,24,26,30,35,25,27],
            'Gender':['Male','Male','Male','Female','Female','Female','Male','Male']}
df =pd.DataFrame(database)
print(df)

      Name  Salary  No_of_Experience   Domain  Age  Gender
0   Nikhil   20000                 2     Tech   22    Male
1   Aniket   30000                 3  NonTech   23    Male
2    Mihir   25000                 1       HR   24    Male
3    Tanvi   35000                 4      R&D   26  Female
4  Hemangi   20000                 3  NonTech   30  Female
5    Disha   39000                 5     Tech   35  Female
6     Ajay  400000                 2       HR   25    Male
7    Aryan   45000                 1      R&D   27    Male

In [40]:
# Checking dataset information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              8 non-null      object
 1   Salary            8 non-null      int64
 2   No_of_Experience  8 non-null      int64
 3   Domain            8 non-null      object
 4   Age               8 non-null      int64
 5   Gender            8 non-null      object
dtypes: int64(3), object(3)
memory usage: 516.0+ bytes

In [41]:
# Evaluating the maximum no of experience
df['No_of_Experience'].max()

5

In [42]:
df['No_of_Experience'].min()

1

In [44]:
df['No_of_Experience'].mean()

2.625

In [45]:
df[df['Gender']== 'Female']

      Name  Salary  No_of_Experience   Domain  Age  Gender
3    Tanvi   35000                 4      R&D   26  Female
4  Hemangi   20000                 3  NonTech   30  Female
5    Disha   39000                 5     Tech   35  Female

In [46]:
df[df['Gender']== 'Female'].max()

Name                 Tanvi
Salary               39000
No_of_Experience         5
Domain                Tech
Age                     35
Gender              Female
dtype: object

In [48]:
df[df['Salary']== 39000]

    Name  Salary  No_of_Experience Domain  Age  Gender
5  Disha   39000                 5   Tech   35  Female

In [50]:
df['Gender'].value_counts()

Gender
Male      5
Female    3
Name: count, dtype: int64